jsnyder/python-on-a-chip/src/platform/pic24/include/pic24_util.h
/*
 * "Copyright (c) 2008 Robert B. Reese, Bryan A. Jones, J. W. Bruce ("AUTHORS")"
 * All rights reserved.
 * (R. Reese, reese_AT_ece.msstate.edu, Mississippi State University)
 * (B. A. Jones, bjones_AT_ece.msstate.edu, Mississippi State University)
 * (J. W. Bruce, jwbruce_AT_ece.msstate.edu, Mississippi State University)
 *
 * Permission to use, copy, modify, and distribute this software and its
 * documentation for any purpose, without fee, and without written agreement is
 * hereby granted, provided that the above copyright notice, the following
 * two paragraphs and the authors appear in all copies of this software.
 *
 * IN NO EVENT SHALL THE "AUTHORS" BE LIABLE TO ANY PARTY FOR
 * DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES ARISING OUT
 * OF THE USE OF THIS SOFTWARE AND ITS DOCUMENTATION, EVEN IF THE "AUTHORS"
 * HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 * THE "AUTHORS" SPECIFICALLY DISCLAIMS ANY WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY
 * AND FITNESS FOR A PARTICULAR PURPOSE.  THE SOFTWARE PROVIDED HEREUNDER IS
 * ON AN "AS IS" BASIS, AND THE "AUTHORS" HAS NO OBLIGATION TO
 * PROVIDE MAINTENANCE, SUPPORT, UPDATES, ENHANCEMENTS, OR MODIFICATIONS."
 *
 * Please maintain this header in its entirety when copying/modifying
 * these files.
 *
 *
 */

// Documentation for this file. If the \file tag isn't present,
// this file won't be documented.
/** \file
 *  This file contains miscellaneous functions that
 *  that do not fall under any particular category.
 *  See pic24_util.c for details on how
 *  these functions were implemented.
 */

#ifndef  _PIC24_UTIL_H_
#define _PIC24_UTIL_H_

/** \name Chip identification
 *  These routines assist in identifying the device and revision
 *  of the PIC in use. See checkDeviceAndRevision() for a usage
 *  example.
 */
//@{
/** The location in program memory of the device ID.
 *  Revision information is found in the Silicon Errata
 *  sheet for the device. The Device ID is contained
 * in the datasheet for the target device.
 */
#define DEV_ID_LOCATION 0xFF0000
/** The location in program memory of the revision. */
#define REVISION_LOCATION 0xFF0002


#if defined(__PIC24HJ12GP201__) || defined(__DOXYGEN__)
/** The device ID for this chip, located in program memory
 *  at \ref DEV_ID_LOCATION.
 */
#define DEV_ID 0x00080a
/** A string to identify this chip, printed by 
 *  checkDeviceAndRevision().
 */
#define DEV_ID_STR "PIC24HJ12GP201"
/** A revision for this device, located in program memory
 *  at \ref REVISION_LOCATION. Additional revisions
 *  can be defined as EXPECTED_REVISIONn, where n = 1..5.
 */
#define EXPECTED_REVISION1 0x003001
/** A string to accompany this revision, printed by 
 *  checkDeviceAndRevision(). Additional revision strings
 *  can be defined as EXPECTED_REVISIONn, where n = 1..5.
 */
#define EXPECTED_REVISION1_STR "A2"

#define EXPECTED_REVISION2 0x003002
#define EXPECTED_REVISION2_STR "A3"
#define EXPECTED_REVISION3 0x003003
#define EXPECTED_REVISION3_STR "A4"
#endif

#ifdef __PIC24HJ12GP202__
#define DEV_ID 0x00080B
#define DEV_ID_STR "PIC24HJ12GP202"
#define EXPECTED_REVISION1 0x003001
#define EXPECTED_REVISION1_STR "A2"
#define EXPECTED_REVISION2 0x003002
#define EXPECTED_REVISION2_STR "A3"
#define EXPECTED_REVISION3 0x003003
#define EXPECTED_REVISION3_STR "A4"
#endif



/*  PIC24H32GP202/204,PIC24HJ16GP304  */

#ifdef __PIC24HJ16GP304__
#define DEV_ID 0x000F17
#define DEV_ID_STR "PIC24HJ16GP304"
#endif

#ifdef __PIC24HJ32GP202__
#define DEV_ID 0x000F1D
#define DEV_ID_STR "PIC24HJ32GP202"
#endif

#ifdef __PIC24HJ32GP204__
#define DEV_ID 0x000F1F
#define DEV_ID_STR "PIC24HJ32GP204"
#endif

#if (defined(__PIC24HJ16GP304__) || defined(__PIC24HJ32GP202__) || defined(__PIC24HJ32GP204__))
#define EXPECTED_REVISION1 0x003001
#define EXPECTED_REVISION1_STR "A2"
#define EXPECTED_REVISION2 0x003002
#define EXPECTED_REVISION2_STR "A3"
#define EXPECTED_REVISION3 0x003004
#define EXPECTED_REVISION3_STR "A4"
#define EXPECTED_REVISION4 0x003005
#define EXPECTED_REVISION4_STR "A5"
#endif

/*  PIC24H32GP302/304, PIC24HJGPX02/X04, PIC24HJ128GPX02/X04 */

#ifdef __PIC24HJ32GP302__
#define DEV_ID 0x000645
#define DEV_ID_STR "PIC24HJ32GP302"
#endif

#ifdef __PIC24HJ32GP304__
#define DEV_ID 0x000647
#define DEV_ID_STR "PIC24HJ32GP304"
#endif

#ifdef __PIC24HJ64GP202__
#define DEV_ID 0x000655
#define DEV_ID_STR "PIC24HJ64GP202"
#endif

#ifdef __PIC24HJ64GP204__
#define DEV_ID 0x000657
#define DEV_ID_STR "PIC24HJ64GP204"
#endif

#ifdef __PIC24HJ64GP502__
#define DEV_ID 0x000675
#define DEV_ID_STR "PIC24HJ64GP502"
#endif

#ifdef __PIC24HJ64GP504__
#define DEV_ID 0x000677
#define DEV_ID_STR "PIC24HJ64GP504"
#endif

#ifdef __PIC24HJ128GP202__
#define DEV_ID 0x000665
#define DEV_ID_STR "PIC24HJ128GP202"
#endif


#ifdef __PIC24HJ128GP204__
#define DEV_ID 0x000667
#define DEV_ID_STR "PIC24HJ128GP204"
#endif

#ifdef __PIC24HJ128GP502__
#define DEV_ID 0x00067d
#define DEV_ID_STR "PIC24HJ128GP502"
#endif

#ifdef __PIC24HJ128GP504__
#define DEV_ID 0x00067f
#define DEV_ID_STR "PIC24HJ128GP504"
#endif

#if (defined(__PIC24HJ128GP504__) || defined(__PIC24HJ128GP502__)\
|| defined(__PIC24HJ128GP204__) ||   defined(__PIC24HJ128GP202__)\
|| defined(__PIC24HJ64GP504__) ||   defined(__PIC24HJ64GP502__)\
|| defined(__PIC24HJ64GP204__) ||   defined(__PIC24HJ64GP202__)\
|| defined(__PIC24HJ32GP304__) ||   defined(__PIC24HJ32GP302__))
#define EXPECTED_REVISION1 0x003001
#define EXPECTED_REVISION1_STR "A1"
#define EXPECTED_REVISION2 0x003002
#define EXPECTED_REVISION2_STR "A2"
#define EXPECTED_REVISION3 0x003003
#define EXPECTED_REVISION3_STR "A3"
#endif


/*  PIC24HJXXXGPX06/X08/X10 */

#ifdef __PIC24HJ64GP206__
#define DEV_ID 0x000041
#define DEV_ID_STR "PIC24HJ64GP206"
#endif

#ifdef __PIC24HJ64GP210__
#define DEV_ID 0x000047
#define DEV_ID_STR "PIC24HJ64GP210"
#endif

#ifdef __PIC24HJ64GP506__
#define DEV_ID 0x000049
#define DEV_ID_STR "PIC24HJ64GP506"
#endif

#ifdef __PIC24HJ64GP510__
#define DEV_ID 0x00004B
#define DEV_ID_STR "PIC24HJ64GP510"
#endif

#ifdef __PIC24HJ128GP206__
#define DEV_ID 0x00005D
#define DEV_ID_STR "PIC24HJ128GP206"
#endif

#ifdef __PIC24HJ128GP210__
#define DEV_ID 0x00005F
#define DEV_ID_STR "PIC24HJ128GP210"
#endif

#ifdef __PIC24HJ128GP306__
#define DEV_ID 0x000065
#define DEV_ID_STR "PIC24HJ128GP306"
#endif

#ifdef __PIC24HJ128GP310__
#define DEV_ID 0x000067
#define DEV_ID_STR "PIC24HJ128GP310"
#endif


#ifdef __PIC24HJ128GP506__
#define DEV_ID 0x000061
#define DEV_ID_STR "PIC24HJ128GP506"
#endif

#ifdef __PIC24HJ128GP510__
#define DEV_ID 0x000063
#define DEV_ID_STR "PIC24HJ128GP510"
#endif

#ifdef __PIC24HJ256GP206__
#define DEV_ID 0x000071
#define DEV_ID_STR "PIC24HJ256GP206"
#endif

#ifdef __PIC24HJ256GP210__
#define DEV_ID 0x000073
#define DEV_ID_STR "PIC24HJ256GP210"
#endif


#ifdef __PIC24HJ256GP610__
#define DEV_ID 0x00007B
#define DEV_ID_STR "PIC24HJ256GP610"
#endif

#if (defined(__PIC24HJ64GP206__) || defined(__PIC24HJ64GP210__) || defined(__PIC24HJ64GP506__) || defined(__PIC24HJ64GP510__)\
|| defined(__PIC24HJ128GP206__) || defined(__PIC24HJ128GP210__) || defined(__PIC24HJ128GP306__)\
|| defined(__PIC24HJ128GP310__) || defined(__PIC24HJ128GP506__)|| defined(__PIC24HJ128GP510__)\
|| defined(__PIC24HJ256GP206__) || defined(__PIC24HJ256GP210__)|| defined(__PIC24HJ256GP610__))

#define EXPECTED_REVISION1 0x003002
#define EXPECTED_REVISION1_STR "A2"
#define EXPECTED_REVISION2 0x003004
#define EXPECTED_REVISION2_STR "A3"
#define EXPECTED_REVISION3 0x003040
#define EXPECTED_REVISION3_STR "A4"
#endif


