jsnyder/python-on-a-chip/src/platform/pic24/include/pic24_util.h
//24F Family

/* PIC24FJ128GA010 Family  */

#ifdef __PIC24FJ128GA010__
#define DEV_ID 0x00040D
#define DEV_ID_STR "PIC24FJ128GA010"
#endif

#ifdef __PIC24FJ96GA010__
#define DEV_ID 0x00040C
#define DEV_ID_STR "PIC24FJ96GA010"
#endif

#ifdef __PIC24FJ64GA010__
#define DEV_ID 0x00040B
#define DEV_ID_STR "PIC24FJ64GA010"
#endif

#ifdef __PIC24FJ128GA008__
#define DEV_ID 0x00040A
#define DEV_ID_STR "PIC24FJ128GA008"
#endif

#ifdef __PIC24FJ96GA008__
#define DEV_ID 0x000409
#define DEV_ID_STR "PIC24FJ96GA008"
#endif

#ifdef __PIC24FJ64GA008__
#define DEV_ID 0x000408
#define DEV_ID_STR "PIC24FJ64GA008"
#endif

#ifdef __PIC24FJ128GA006__
#define DEV_ID 0x000407
#define DEV_ID_STR "PIC24FJ128GA006"
#endif

#ifdef __PIC24FJ96GA006__
#define DEV_ID 0x000409
#define DEV_ID_STR "PIC24FJ96GA006"
#endif

#ifdef __PIC24FJ64GA006__
#define DEV_ID 0x000408
#define DEV_ID_STR "PIC24FJ64GA006"
#endif

#if (defined(__PIC24FJ128GA010__) || defined(__PIC24FJ96GA010__) || defined(__PIC24FJ64GA010__)\
|| defined(__PIC24FJ128GA008__) || defined(__PIC24FJ96GA008__) || defined(__PIC24FJ64GA008__)\
|| defined(__PIC24FJ128GA006__) || defined(__PIC24FJ96GA006__) || defined(__PIC24FJ64GA006__))
#define EXPECTED_REVISION1 0x003002
#define EXPECTED_REVISION1_STR "A2"
#define EXPECTED_REVISION2 0x003003
#define EXPECTED_REVISION2_STR "A3"
#define EXPECTED_REVISION3 0x003007  
#define EXPECTED_REVISION3_STR "A4"
#define EXPECTED_REVISION4 0x003043  
#define EXPECTED_REVISION4_STR "C1"
#define EXPECTED_REVISION5 0x003044  
#define EXPECTED_REVISION5_STR "C2"
#endif



//PIC24FJ64GA104 Family
#ifdef __PIC24FJ32GA102__
#define DEV_ID 0x004202
#define DEV_ID_STR "PIC24FJ32GA102"
#endif
#ifdef __PIC24FJ32GA104__
#define DEV_ID 0x00420A
#define DEV_ID_STR "PIC24FJ32GA104"
#endif
#ifdef __PIC24FJ64GA102__
#define DEV_ID 0x004206
#define DEV_ID_STR "PIC24FJ64GA102"
#endif
#ifdef __PIC24FJ64GA104__
#define DEV_ID 0x00420E
#define DEV_ID_STR "PIC24FJ64GA104"
#endif


#if (defined(__PIC24FJ32GA102__) || defined(__PIC24FJ32GA104__)\
|| defined(__PIC24FJ64GA102__) || defined(__PIC24FJ64GA104__)) 
#define EXPECTED_REVISION1 0x000002
#define EXPECTED_REVISION1_STR "A2"
#endif


//PIC24FJXXGA002 (28 pin),PIC24FJXXGA004 (44 pin)
#ifdef __PIC24FJ16GA002__
#define DEV_ID 0x000444
#define DEV_ID_STR "PIC24FJ16GA002"
#endif

#ifdef __PIC24FJ32GA002__
#define DEV_ID 0x000445
#define DEV_ID_STR "PIC24FJ32GA002"
#endif

#ifdef __PIC24FJ48GA002__
#define DEV_ID 0x000446
#define DEV_ID_STR "PIC24FJ48GA002"
#endif

#ifdef __PIC24FJ64GA002__
#define DEV_ID 0x000447
#define DEV_ID_STR "PIC24FJ64GA002"
#endif

#ifdef __PIC24FJ16GA004__
#define DEV_ID 0x00044C
#define DEV_ID_STR "PIC24FJ16GA004"
#endif

#ifdef __PIC24FJ32GA004__
#define DEV_ID 0x00044D
#define DEV_ID_STR "PIC24FJ32GA004"
#endif

#ifdef __PIC24FJ48GA004__
#define DEV_ID 0x00044E
#define DEV_ID_STR "PIC24FJ48GA004"
#endif

#ifdef __PIC24FJ64GA004__
#define DEV_ID 0x00044F
#define DEV_ID_STR "PIC24FJ64GA004"
#endif

#if (defined(__PIC24FJ64GA004__) || defined(__PIC24FJ48GA004__) || defined(__PIC24FJ32GA004__) || defined(__PIC24FJ16GA004__)\
|| defined(__PIC24FJ64GA002__) || defined(__PIC24FJ48GA002__) || defined(__PIC24FJ32GA002__) || defined(__PIC24FJ16GA002__))

#define EXPECTED_REVISION1 0x003003
#define EXPECTED_REVISION1_STR "A3/A4"
#define EXPECTED_REVISION2 0x003042
#define EXPECTED_REVISION2_STR "B4"
#define EXPECTED_REVISION3 0x003043
#define EXPECTED_REVISION3_STR "B5"
#endif


/* GA110, GA108,GA106 Family */


#ifdef __PIC24FJ256GA110__
#define DEV_ID 0x00101E
#define DEV_ID_STR "PIC24FJ256GA110"
#endif

#ifdef __PIC24FJ192GA110__
#define DEV_ID 0x001016
#define DEV_ID_STR "PIC24FJ192GA110"
#endif

#ifdef __PIC24FJ128GA110__
#define DEV_ID 0x00100E
#define DEV_ID_STR "PIC24FJ128GA110"
#endif

#ifdef __PIC24FJ256GA108__
#define DEV_ID 0x00101A
#define DEV_ID_STR "PIC24FJ256GA108"
#endif

#ifdef __PIC24FJ192GA108__
#define DEV_ID 0x001012
#define DEV_ID_STR "PIC24FJ192GA108"
#endif

#ifdef __PIC24FJ128GA108__
#define DEV_ID 0x00100A
#define DEV_ID_STR "PIC24FJ128GA108"
#endif

#ifdef __PIC24FJ256GA106__
#define DEV_ID 0x001018
#define DEV_ID_STR "PIC24FJ256GA106"
#endif

#ifdef __PIC24FJ192GA106__
#define DEV_ID 0x001010
#define DEV_ID_STR "PIC24FJ192GA106"
#endif

#ifdef __PIC24FJ128GA106__
#define DEV_ID 0x001008
#define DEV_ID_STR "PIC24FJ128GA106"
#endif

#if (defined(__PIC24FJ256GA110__) || defined(__PIC24FJ192GA110__) || defined(__PIC24FJ128GA110__)\
|| defined(__PIC24FJ256GA108__) || defined(__PIC24FJ192GA108__) || defined(__PIC24FJ128GA108__)\
|| defined(__PIC24FJ256GA106__) || defined(__PIC24FJ192GA106__) || defined(__PIC24FJ128GA106__))

#define EXPECTED_REVISION1 0x003001
#define EXPECTED_REVISION1_STR "A3"
#define EXPECTED_REVISION2 0x003003
#define EXPECTED_REVISION2_STR "A5"
#endif

/***** PIC24F K ****/

#ifdef __PIC24F04KA200__
#define DEV_ID 0x000D02
#define DEV_ID_STR "PIC24F04KA200"
#endif

#ifdef __PIC24F04KA201__
#define DEV_ID 0x000D00
#define DEV_ID_STR "PIC24F04KA201"
#endif

#if (defined(__PIC24F04KA200__) || defined(__PIC24F04KA201__) )
#define EXPECTED_REVISION1 0x000001
#define EXPECTED_REVISION1_STR "A1"
#endif


#ifdef __PIC24F08KA101__
#define DEV_ID 0x000D08
#define DEV_ID_STR "PIC24F08KA101"
#endif

#ifdef __PIC24F08KA102__
#define DEV_ID 0x000D0A
#define DEV_ID_STR "PIC24F08KA102"
#endif

#ifdef __PIC24F16KA101__
#define DEV_ID 0x000D01
#define DEV_ID_STR "PIC24F16KA101"
#endif

#ifdef __PIC24F16KA102__
#define DEV_ID 0x000D03
#define DEV_ID_STR "PIC24F16KA102"
#endif

#if (defined(__PIC24F08KA101__) || defined(__PIC24F08KA102__) || defined(__PIC24F16KA101__)\
|| defined(__PIC24F16KA102__))

#define EXPECTED_REVISION1 0x000005
#define EXPECTED_REVISION1_STR "A5"
#define EXPECTED_REVISION2 0x000006
#define EXPECTED_REVISION2_STR "A6"
#endif



/***** PIC24F GB ****/

#ifdef __PIC24FJ256GB110__
#define DEV_ID 0x00101F
#define DEV_ID_STR "PIC24FJ256GB110"
#endif

#ifdef __PIC24FJ192GB110__
#define DEV_ID 0x001017
#define DEV_ID_STR "PIC24FJ192GB110"
#endif

#ifdef __PIC24FJ128GB110__
#define DEV_ID 0x00100F
#define DEV_ID_STR "PIC24FJ128GB110"
#endif

#ifdef __PIC24FJ64GB110__
#define DEV_ID 0x001007
#define DEV_ID_STR "PIC24FJ64GB110"
#endif

#ifdef __PIC24FJ256GB108__
#define DEV_ID 0x00101B
#define DEV_ID_STR "PIC24FJ256GB108"
#endif

#ifdef __PIC24FJ192GB108__
#define DEV_ID 0x001013
#define DEV_ID_STR "PIC24FJ192GB108"
#endif

#ifdef __PIC24FJ128GB108__
#define DEV_ID 0x00100B
#define DEV_ID_STR "PIC24FJ128GB108"
#endif

