jsnyder/python-on-a-chip/src/platform/pic24/include/pic24_util.h
#ifdef __PIC24FJ64GB108__
#define DEV_ID 0x001003
#define DEV_ID_STR "PIC24FJ64GB108"
#endif

#ifdef __PIC24FJ256GB106__
#define DEV_ID 0x001018
#define DEV_ID_STR "PIC24FJ256GB106"
#define EXPECTED_REVISION1 0x000001
#define EXPECTED_REVISION1_STR "A3"
#endif

#ifdef __PIC24FJ192GB106__
#define DEV_ID 0x001010
#define DEV_ID_STR "PIC24FJ192GB106"
#endif

#ifdef __PIC24FJ128GB106__
#define DEV_ID 0x001008
#define DEV_ID_STR "PIC24FJ128GB106"
#endif

#ifdef __PIC24FJ64GB106__
#define DEV_ID 0x001001
#define DEV_ID_STR "PIC24FJ64GB106"
#endif

#ifdef __PIC24FJ32GB002__
#define DEV_ID 0x004203
#define DEV_ID_STR "PIC24FJ32GB002"
#endif

#ifdef __PIC24FJ32GB004__
#define DEV_ID 0x00420B
#define DEV_ID_STR "PIC24FJ32GB004"
#endif

#ifdef __PIC24FJ64GB002__
#define DEV_ID 0x004207
#define DEV_ID_STR "PIC24FJ64GB002"
#endif

#ifdef __PIC24FJ64GB004__
#define DEV_ID 0x00420F
#define DEV_ID_STR "PIC24FJ64GB004"
#endif

#if (defined(__PIC24FJ32GB002__) || defined(__PIC24FJ32GB004__) || defined(__PIC24FJ64GB002__) || defined(__PIC24FJ64GB004__))
#define EXPECTED_REVISION1 0x000002
#define EXPECTED_REVISION1_STR "A2"
#endif


#if (defined(__PIC24FJ256GB110__) || defined(__PIC24FJ192GB110__) || defined(__PIC24FJ128GB110__) || defined(__PIC24FJ64GB110__)\
|| defined(__PIC24FJ256GB108__) || defined(__PIC24FJ192GB108__) || defined(__PIC24FJ128GB108__) || defined(__PIC24FJ64GB108__)\
|| defined(__PIC24FJ256GB106__) || defined(__PIC24FJ192GB106__) || defined(__PIC24FJ128GB106__) || defined(__PIC24FJ64GB106__))

#define EXPECTED_REVISION1 0x003001
#define EXPECTED_REVISION1_STR "A3"
#define EXPECTED_REVISION2 0x003003
#define EXPECTED_REVISION2_STR "A5"
#endif

//dsPIC33 CPUS

//dsPIC33FJ12GP201, dsPIC33FJ12GP202
#ifdef __dsPIC33FJ12GP201__
#define DEV_ID 0x000802
#define DEV_ID_STR "dsPIC33FJ12GP201"
#endif

#ifdef __dsPIC33FJ12GP202__
#define DEV_ID 0x000803
#define DEV_ID_STR "dsPIC33FJ12GP202"
#endif

#if (defined(__dsPIC33FJ12GP201__) || defined(__dsPIC33FJ12GP202__))
#define EXPECTED_REVISION1 0x003001
#define EXPECTED_REVISION1_STR "A2"
#define EXPECTED_REVISION2 0x003002
#define EXPECTED_REVISION2_STR "A3"
#define EXPECTED_REVISION3 0x003004
#define EXPECTED_REVISION3_STR "A4"
#endif

//dsPIC33FJ32GP202/04,dsPIC33FJ16GP304

#ifdef __dsPIC33FJ32GP202__
#define DEV_ID 0x000F0D
#define DEV_ID_STR "dsPIC24FJ32GP202"
#endif

#ifdef __dsPIC33FJ32GP204__
#define DEV_ID 0x000F0F
#define DEV_ID_STR "dsPIC33FJ32GP204"
#endif

#ifdef __dsPIC33FJ16GP304__
#define DEV_ID 0x000F07
#define DEV_ID_STR "dsPIC33FJ16GP304"
#endif

#if (defined(__dsPIC33FJ32GP202__) || defined(__dsPIC33FJ32GP204___) || defined(__dsPIC33FJ16GP304__))
#define EXPECTED_REVISION1 0x003001
#define EXPECTED_REVISION1_STR "A2"
#define EXPECTED_REVISION2 0x003002
#define EXPECTED_REVISION2_STR "A3"
#define EXPECTED_REVISION3 0x003004
#define EXPECTED_REVISION3_STR "A4"
#endif

//dsPIC33FJ32GP302/304,dsPIC33FJ64GPX02/X04,dsPIC33FJ128GPX02,X04

#ifdef __dsPIC33FJ32GP302__
#define DEV_ID 0x000605
#define DEV_ID_STR "dsPIC33FJ32GP302"
#endif

#ifdef __dsPIC33FJ32GP304__
#define DEV_ID 0x000607
#define DEV_ID_STR "dsPIC33FJ32GP304"
#endif

#ifdef __dsPIC33FJ64GP202__
#define DEV_ID 0x000615
#define DEV_ID_STR "dsPIC33FJ64GP202"
#endif

#ifdef __dsPIC33FJ64GP204__
#define DEV_ID 0x000617
#define DEV_ID_STR "dsPIC33FJ64GP204"
#endif

#ifdef __dsPIC33FJ64GP802__
#define DEV_ID 0x00061d
#define DEV_ID_STR "dsPIC33FJ64GP802"
#endif

#ifdef __dsPIC33FJ64GP804__
#define DEV_ID 0x00061f
#define DEV_ID_STR "dsPIC33FJ64GP804"
#endif

#ifdef __dsPIC33FJ128GP202__
#define DEV_ID 0x000625
#define DEV_ID_STR "dsPIC33FJ128GP202"
#endif


#ifdef __dsPIC33FJ128GP204__
#define DEV_ID 0x000627
#define DEV_ID_STR "dsPIC33FJ128GP204"
#endif

#ifdef __dsPIC33FJ128GP802__
#define DEV_ID 0x00062d
#define DEV_ID_STR "dsPIC33FJ128GP802"
#endif

#ifdef __dsPIC33FJ128GP804__
#define DEV_ID 0x00062f
#define DEV_ID_STR "dsPIC33FJ128GP804"
#endif

#if (defined(__dsPIC33FJ128GP804__) || defined(__dsPIC33FJ128GP802__)\
|| defined(__dsPIC33FJ128GP204__) ||   defined(__dsPIC33FJ128GP202__)\
|| defined(__dsPIC33FJ64GP804__) ||   defined(__dsPIC33FJ64GP802__)\
|| defined(__dsPIC33FJ64GP204__) ||   defined(__dsPIC33FJ64GP202__)\
|| defined(__dsPIC33FJ32GP304__) ||   defined(__dsPIC33FJ32GP302__))
#define EXPECTED_REVISION1 0x003001
#define EXPECTED_REVISION1_STR "A1"
#define EXPECTED_REVISION2 0x003002
#define EXPECTED_REVISION2_STR "A2"
#define EXPECTED_REVISION3 0x003003
#define EXPECTED_REVISION3_STR "A3"
#endif




/* Use these default device ID and revision values
   if you are trying to discover the ID/Revision by
   executing code on your target device and watching
   was is printed by the printResetCause() function.
*/
#ifndef DEV_ID
#define DEV_ID 0
#define DEV_ID_STR "unknown"
#define EXPECTED_REVISION1 0
#define EXPECTED_REVISION1_STR "unknown"
#warning *********************************************
#warning * Unknown chip type! Define a device ID and *
#warning * revision ID in the lines above for this   *
#warning * chip to remove this warning message.      *
#warning * These values can be found by              *
#warning * executing the checkDeviceAndRevision()    *
#warning * function, which is typically called after *
#warning * reset via calling printResetCause().      *
#warning * This check allows you to ensure that the  *
#warning * programmed hex file is running on the     *
#warning * same device type it was compiled for.     *
#warning * This is only a warning.                   *
#warning *********************************************
#endif

//@}

///\todo Document this section.
//may need variations for auto_psv, no_auto_psv
//auto_psv is default, generates extra code for
//accessing constants in program memory or through
//24 bit points. Just go safe route for now.

//explicitly use  'auto_psv' since that is default and to
//get rid of warning message
#ifdef _ISR
#undef _ISR
//make our own definition that gets rid of warning
#define _ISR __attribute__((interrupt)) __attribute__ ((auto_psv))
#endif

#ifdef _ISRFAST
#undef _ISRFAST
//make our own definition that gets rid of warning
#define _ISRFAST __attribute__((interrupt)) __attribute__ ((no_auto_psv))
#endif


#define SLEEP()  Sleep()
#define IDLE()   Idle()
#define CLRWDT() ClrWdt()
#define NOP() Nop()
#define ENABLEWDT() _SWDTEN = 1
#define DISABLEWDT() _SWDTEN = 0

