jsnyder/python-on-a-chip/src/platform/pic24/include/pic24_util.h
/// \name Peripheral identification
//@{
/** Define the number of UART modules supported by this chip.
 *  NOTE: this only works when testing \#defines, not
 *  testing variable. So, don't test UxSTA; instead,
 *  test _UxRXIF which is uniquely defined for each
 *  UART. (Idea taken from the C30 peripheral library,
 *  in uart.h.)
 */
#if   defined(_U4RXIF)
#define NUM_UART_MODS 4
#elif defined(_U3RXIF)
#define NUM_UART_MODS 3
#elif defined(_U2RXIF)
#define NUM_UART_MODS 2
#elif defined(_U1RXIF) || defined(__DOXYGEN__)
#define NUM_UART_MODS 1
#else
#error UxRXIF flag not defined!
#endif

/** Define the number of I2C modules supported by this chip.
 *  See \ref NUM_UART_MODS for details on this methodology.
 */
#if   defined(_SI2C2IF)
#define NUM_I2C_MODS 2
#elif defined(_SI2C1IF) || defined(__DOXYGEN__)
#define NUM_I2C_MODS 1
#else
#error SI2CxIF flag not defined!
#endif

/** Define the number of SPI modules supported by this chip.
 *  See \ref NUM_UART_MODS for details on this methodology.
 */
#if   defined(_SPI2IF)
#define NUM_SPI_MODS 2
#elif defined(_SPI1IF) || defined(__DOXYGEN__)
#define NUM_SPI_MODS 1
#else
#error SPIxIF flag not defined!
#endif

/** Define the number of ECAN modules supported by this chip.
 *  See \ref NUM_UART_MODS for details on this methodology.
 */
#if   defined(_C2IF)
#define NUM_ECAN_MODS 2
#elif defined(_C1IF) || defined(__DOXYGEN__)
#define NUM_ECAN_MODS 1
#endif
//@}

/** \name Bitfield to struct conversion
 *  <a name="bitfieldMacros">Given</a> a bitfield struct representing an SFR,
 *  convert this to a word (uint16) or to the
 *  high and low bytes (uint8) of that word.
 *  Note: though this looks ugly, it introduces
 *  no unexpected compiler overhead at -O1. See
 *  \ref u16_INTTREGlast for an example.
 */
//@{
/// Convert a bitfield to a word (uint16).
#define BITS2WORD(sfrBitfield)  ( *((uint16*) &sfrBitfield) )
/// Return the low byte (as a uint8) of a bitfield.
#define BITS2BYTEL(sfrBitfield) ( ((uint8*)  &sfrBitfield)[0] )
/// Return the high byte (as a uint8) of a bitfield.
#define BITS2BYTEH(sfrBitfield) ( ((uint8*)  &sfrBitfield)[1] )
//@}

/** Report an error on reset via \ref reportError,
 *  also printing the file and
 *  line number where this macro was called via
 *  a call to \ref ERROR_FILE_LINE.
 *  \param msg Error message to report
 */
#define REPORT_ERROR(msg) reportError(ERROR_FILE_LINE(msg))

#ifdef SIM
#define HELLO_MSG "****************************************************\n" \
                  "*    SIMULATION MODE - DO NOT RUN ON A REAL PIC!   *\n" \
                  "****************************************************\n" \
                  "\n" __FILE__ ", built on " __DATE__ " at " __TIME__ "\n"
// Output a warning during compilation also
#warning ***********************************************
#warning * SIMULATION MODE - DO NOT RUN ON A REAL PIC! *
#warning ***********************************************
#else
#define HELLO_MSG "\n" __FILE__ ", built on " __DATE__ " at " __TIME__ "\n"
#endif



void reportError(const char* szErrorMessage);
uint32 readProgramMemory(uint32 u32_address);
void checkDeviceAndRevision(void);
void checkOscOption(void);
void printResetCause(void);
void configPinsForLowPower(void);
void configBasic(const char* psz_helloMsg);
uint32 roundFloatToUint32(float f_x);
uint16 roundFloatToUint16(float f_x);

///\todo Putting this is a group causes the functions not to be
///      displayed by Doxygen 1.5.8!
/* \name Heartbeat
 *  These routines provide heartbeat support by blinking a LED
 *  on a regular basis. See doHeartbeat() for more information.
 */

#ifndef USE_HEARTBEAT
/** If this macro is true, heartbeat functionality is enabled.
 *  If false, heartbeat is disabled.
 */
#define USE_HEARTBEAT 1
#endif

/** Choose a pin for the heartbeat.
 *  If \ref USE_HEARTBEAT is false, the heartbeat is disabled.
 */
#ifndef HB_LED
#define HB_LED _LATB15
/** Define a config function for the heartbeat pin. */
#define CONFIG_HB_LED() CONFIG_RB15_AS_DIG_OD_OUTPUT()
#endif // #ifndef HB_LED

extern _PERSISTENT char* sz_lastTimeoutError;

#if USE_HEARTBEAT
extern uint32 u32_heartbeatCount;
#endif

void configHeartbeat(void);
void doHeartbeat(void);
void toggleHeartbeat(void);


#endif
